###############################################################################
# Created by write_sdc
###############################################################################
current_design characterization_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_bad_duty}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_fast}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_slow}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_stuck_high}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_stuck_low}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_clk_0}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_clk_1}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_clk_2}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {busy}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock_status_reg[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner_class_reg[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner_class_reg[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner_class_reg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_0[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_1[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {delay_count_reg_2[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_0[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_1[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ro_count_reg_2[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {status_reg[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {busy}]
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[7]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[6]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[5]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[4]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[3]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[2]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[1]}]
set_load -pin_load 0.0334 [get_ports {clock_status_reg[0]}]
set_load -pin_load 0.0334 [get_ports {corner_class_reg[2]}]
set_load -pin_load 0.0334 [get_ports {corner_class_reg[1]}]
set_load -pin_load 0.0334 [get_ports {corner_class_reg[0]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[15]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[14]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[13]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[12]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[11]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[10]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[9]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[8]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[7]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[6]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[5]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[4]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[3]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[2]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[1]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_0[0]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[15]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[14]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[13]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[12]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[11]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[10]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[9]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[8]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[7]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[6]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[5]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[4]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[3]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[2]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[1]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_1[0]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[15]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[14]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[13]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[12]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[11]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[10]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[9]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[8]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[7]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[6]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[5]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[4]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[3]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[2]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[1]}]
set_load -pin_load 0.0334 [get_ports {delay_count_reg_2[0]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[7]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[6]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[5]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[4]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[3]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[2]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[1]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_0[0]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[7]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[6]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[5]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[4]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[3]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[2]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[1]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_1[0]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[7]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[6]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[5]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[4]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[3]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[2]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[1]}]
set_load -pin_load 0.0334 [get_ports {ro_count_reg_2[0]}]
set_load -pin_load 0.0334 [get_ports {status_reg[7]}]
set_load -pin_load 0.0334 [get_ports {status_reg[6]}]
set_load -pin_load 0.0334 [get_ports {status_reg[5]}]
set_load -pin_load 0.0334 [get_ports {status_reg[4]}]
set_load -pin_load 0.0334 [get_ports {status_reg[3]}]
set_load -pin_load 0.0334 [get_ports {status_reg[2]}]
set_load -pin_load 0.0334 [get_ports {status_reg[1]}]
set_load -pin_load 0.0334 [get_ports {status_reg[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_bad_duty}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_fast}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_slow}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_stuck_high}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_stuck_low}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ro_clk_0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ro_clk_1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ro_clk_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
