###############################################################################
# Created by write_sdc
###############################################################################
current_design ro_physical_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name null -period 10.0000 
set_clock_uncertainty 0.2500 null
set_input_delay 2.0000 -clock [get_clocks {null}] -add_delay [get_ports {enable}]
set_output_delay 2.0000 -clock [get_clocks {null}] -add_delay [get_ports {ro_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ro_out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
